<?php
/**
 * Lamb - A PHP Framework For my children
 *
 * @package  Lame
 * @author   congli huang <1064344315@qq.com>
 */

/*
|--------------------------------------------------------------------------
| application 配置文件
|--------------------------------------------------------------------------
|
| application配置文件是整个框架的总配置文件，里面的配置主要分两类: 一种是自定义加载那些配置文件;另一种是框架
| 启动时默认的类
|
*/
require(__DIR__.'/application/config/application.php');
/*
|--------------------------------------------------------------------------
| application 类定义文件
|--------------------------------------------------------------------------
|
| application 类定义
|
*/
require(__DIR__.'/system/core/application.php');
/*
|--------------------------------------------------------------------------
| 框架启动时自动注册默认的类文件
|--------------------------------------------------------------------------
|
| 框架启动时自动注册默认的类
|
*/
require(__DIR__.'/application/bootstrap/start.php');
/*
|--------------------------------------------------------------------------
| application 初始化方法
|--------------------------------------------------------------------------
|
| application 初始化
|
*/
Application::init();
/*
|--------------------------------------------------------------------------
| application 运行方法
|--------------------------------------------------------------------------
|
| application 引擎运行入口，听,那引擎"隆隆"的响声
|
*/
Application::run();
?>